#include <iostream>
#include <fstream>
#include <string>
#include "List.h"
#include "Keeper.h"
#include "Tree.h"
#include "Member.h"


int main()
{
	std::cout << "Hello World!\n";
}

/*
Разработать класс Keeper, который реализует контейнер для хранения и 
обработки объектов. Класс Keeper должен обеспечивать следующие функции:
	▪ добавление и удаление производных объектов абстрактного класса Base;
	▪ полное сохранение себя в файле;
	▪ полное восстановление себя из файла.


Класс Фамильное дерево хранит данные о семье. 
Каждый член семьи имеет:
	ФИО, знания о родителях, знания о супруге, знания о своих детях, 
	дату рождения, дату смерти (если есть), возраст. 
*/